# Pandas

## Pandas series

A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.2.2'

In [4]:
list_ser = [11,12,13,14,15]
ser = pd.Series(list_ser, dtype=float)
print(ser)
print(type(ser))

0    11.0
1    12.0
2    13.0
3    14.0
4    15.0
dtype: float64
<class 'pandas.core.series.Series'>

In [5]:
ser.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
ser.values

array([11., 12., 13., 14., 15.])

In [7]:
print(ser[0])

11.0

In [8]:
ser[ser > 12]

2    13.0
3    14.0
4    15.0
dtype: float64

In [9]:
pd.Series(data=[21,"hello", True], index=["a","b","c"],dtype=str, name="Data")

a       21
b    hello
c     True
Name: Data, dtype: object

In [10]:
dict = {"day1": 21, "day2": "hello", "day3": True}

# this will return all the keys
dic_ser = pd.Series(dict)
print(dic_ser)
print(dic_ser["day1"])

# this will return only day1 and day2
print(pd.Series(dic_ser, index=["day1", "day2"]))

day1       21
day2    hello
day3     True
dtype: object
21
day1       21
day2    hello
dtype: object

In [11]:
dic_ser[dic_ser == True]

day3    True
dtype: object

In [12]:
dic_ser[1:3]

day2    hello
day3     True
dtype: object

In [13]:
dic_ser["day1":"day3":2]

day1      21
day3    True
dtype: object

In [14]:
"day1" in dic_ser

True

In [15]:
ser.sum()

65.0

In [16]:
ser.mean()

13.0

In [17]:
print(pd.concat([ser, dic_ser]))

0        11.0
1        12.0
2        13.0
3        14.0
4        15.0
day1       21
day2    hello
day3     True
dtype: object

## Data frames in Pandas

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.

In [18]:
data = {
    "calories": [420, 380, 390, 400, 410, 420],
    "duration": [50, 40, 45, 46, 47, 48]
}

df = pd.DataFrame(data, index=["day1", "day2", "day3", "day4", "day5", "day6"])
print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45
day4       400        46
day5       410        47
day6       420        48

In [19]:
params = pd.DataFrame([[21, 5.9, 120], [22, 6, 130], [23, 6.1, 140],[24, 6.2, 150], [25, 6.3, 160]], columns=["Age", "Height", "Weight"])
params

   Age  Height  Weight
0   21     5.9     120
1   22     6.0     130
2   23     6.1     140
3   24     6.2     150
4   25     6.3     160

### locate row - dataframe.loc[row, column]

Pandas use the loc attribute to return one or more specified row(s)

In [20]:
print(df.loc["day1"])
print(df.loc["day3"])
print(df.loc[["day2"]])
print(df.loc[["day1", "day3"]])

calories    420
duration     50
Name: day1, dtype: int64
calories    390
duration     45
Name: day3, dtype: int64
      calories  duration
day2       380        40
      calories  duration
day1       420        50
day3       390        45

In [97]:
data = [[50, True], [40, False], [30, False]]
label_rows = ["Sally", "Mary", "John"]
label_cols = ["age", "qualified"]

df = pd.DataFrame(data, label_rows, label_cols)
df.loc['Mary']

age             40
qualified    False
Name: Mary, dtype: object

In [98]:
df.loc['Mary', 'age']

40

In [102]:
# df.loc['Sally', 'Mary'] This tries to access row 'Sally' and column 'Mary', but 'Mary' is not a column name.

# To get rows for both 'Sally' and 'Mary':
df.loc[['Sally', 'Mary']]

       age  qualified
Sally   50       True
Mary    40      False

In [103]:
df.loc[['Sally', 'Mary'], 'age']

Sally    50
Mary     40
Name: age, dtype: int64

In [105]:
df.loc["Sally": "John", 'age']

Sally    50
Mary     40
John     30
Name: age, dtype: int64

### Named indexes

In [21]:

print(df.loc["day1"])
# print(df.iloc["day1"]) // this will throw an error as iloc is for integer indexing

calories    420
duration     50
Name: day1, dtype: int64

### iloc - The iloc property gets, or sets, the value(s) of the specified indexes.

In [106]:
df.iloc[[0, 2]]

       age  qualified
Sally   50       True
John    30      False

In [108]:
df.iloc[[1,2], 0]

Mary    40
John    30
Name: age, dtype: int64

## Info

Provides how many rows or data or entries in DF, how many columns, null values, non-null values

In [22]:
print(df.info())
print(params.info())

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, day1 to day6
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  6 non-null      int64
 1   duration  6 non-null      int64
dtypes: int64(2)
memory usage: 316.0+ bytes
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     5 non-null      int64
 1   Height  5 non-null      float64
 2   Weight  5 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 252.0 bytes
None

In [23]:
print(df.columns)
print(df.index)
print(df.values)
print(df.dtypes)
print(df.T)
print(df.shape)

# this will return the first
print(df.head())

# this will return the last
print(df.tail())

Index(['calories', 'duration'], dtype='object')
Index(['day1', 'day2', 'day3', 'day4', 'day5', 'day6'], dtype='object')
[[420  50]
 [380  40]
 [390  45]
 [400  46]
 [410  47]
 [420  48]]
calories    int64
duration    int64
dtype: object
          day1  day2  day3  day4  day5  day6
calories   420   380   390   400   410   420
duration    50    40    45    46    47    48
(6, 2)
      calories  duration
day1       420        50
day2       380        40
day3       390        45
day4       400        46
day5       410        47
      calories  duration
day2       380        40
day3       390        45
day4       400        46
day5       410        47
day6       420        48

In [24]:
# this will return summary stats of the dataframe which includes count, mean, std, min, 25%, 50%, 75%, and max
print(df.describe())

         calories   duration
count    6.000000   6.000000
mean   403.333333  46.000000
std     16.329932   3.405877
min    380.000000  40.000000
25%    392.500000  45.250000
50%    405.000000  46.500000
75%    417.500000  47.750000
max    420.000000  50.000000

### DF from dictionary

In [25]:
province_dict = {
    "province": ["AB", "BC", "MB", "NB", "NL", "NT", "NS", "ON", "PE", "QC", "SK", "YT"],
    "population": [1234567, 2345678, 3456789, 4567890, 5678901, 6789012, 7890123, 8901234, 9012345, 123456, 1234567, 2345678],
    "area": [1234567, 2345678, 3456789, 4567890, 5678901, 6789012, 7890123, 8901234, 9012345, 123456, 1234567, 2345678],
}

province_df = pd.DataFrame(province_dict)
print(province_df)

   province  population     area
0        AB     1234567  1234567
1        BC     2345678  2345678
2        MB     3456789  3456789
3        NB     4567890  4567890
4        NL     5678901  5678901
5        NT     6789012  6789012
6        NS     7890123  7890123
7        ON     8901234  8901234
8        PE     9012345  9012345
9        QC      123456   123456
10       SK     1234567  1234567
11       YT     2345678  2345678

### Rename the columns name

In [26]:
province_df = province_df.rename(columns={"province": "Province", "population": "Population", "area": "Area"})
# or 
# province_df.columns = ["Province", "Population", "Area"]
print(province_df)

   Province  Population     Area
0        AB     1234567  1234567
1        BC     2345678  2345678
2        MB     3456789  3456789
3        NB     4567890  4567890
4        NL     5678901  5678901
5        NT     6789012  6789012
6        NS     7890123  7890123
7        ON     8901234  8901234
8        PE     9012345  9012345
9        QC      123456   123456
10       SK     1234567  1234567
11       YT     2345678  2345678

In [113]:
df.columns = ['Age', 'Qualified']
df

       Age  Qualified
Sally   50       True
Mary    40      False
John    30      False

### Set index

In [27]:
province_df = province_df.set_index("Province")
print(province_df)

          Population     Area
Province
AB           1234567  1234567
BC           2345678  2345678
MB           3456789  3456789
NB           4567890  4567890
NL           5678901  5678901
NT           6789012  6789012
NS           7890123  7890123
ON           8901234  8901234
PE           9012345  9012345
QC            123456   123456
SK           1234567  1234567
YT           2345678  2345678

In [28]:
print(province_df.shape) # this won't include the index
print(province_df.size) # this will include the index

(12, 2)
24

## Loading data file into Panda DF

In [29]:
# reading a csv file
province_read_csv = pd.read_csv("prov_support.csv", sep=",", skiprows=1, index_col="Province Abbreviation", names=["Province Abbreviation", "Province Name", "2016", "2017", "2018"])
# province_read_csv.columns = ["Province Abbreviation", "Province Name", "2016", "2017", "2018"]
# province_read_csv.set_index("Province Abbreviation", inplace=True)
print(province_read_csv)

                                   Province Name   2016   2017   2018
Province Abbreviation
NL                     Newfoundland and Labrador    724    734    750
PE                          Prince Edward Island    584    601    638
NS                                   Nova Scotia   3060   3138   3201
NB                                 New Brunswick   2741   2814   2956
QC                                        Quebec  21372  22720  23749
ON                                       Ontario  21347  21101  21420
MB                                      Manitoba   3531   3675   3965
SK                                  Saskatchewan   1565   1613   1673
AB                                       Alberta   5772   5943   6157
BC                              British Columbia   6482   6680   6925
YT                                         Yukon    946    973   1006
NT                         Northwest Territories   1281   1294   1319
NU                                       Nunavut   1539   1583   1634

In [30]:
province_read_csv.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13 entries, NL to NU
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Province Name  13 non-null     object
 1   2016           13 non-null     int64
 2   2017           13 non-null     int64
 3   2018           13 non-null     int64
dtypes: int64(3), object(1)
memory usage: 520.0+ bytes

## Writing to CSV file

In [31]:
csv_file = df.to_csv("pandas_practice.csv")
print(csv_file)
# this will create a new file called "pandas_practice.csv" in the current directory

None

In [32]:
df.to_csv("pandas_df.csv", sep="\t", header= True, index= True)

### DF axes

In [33]:
df.axes

[Index(['day1', 'day2', 'day3', 'day4', 'day5', 'day6'], dtype='object'),
 Index(['calories', 'duration'], dtype='object')]

In [34]:
params.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Age', 'Height', 'Weight'], dtype='object')]

In [35]:
province_df.axes

[Index(['AB', 'BC', 'MB', 'NB', 'NL', 'NT', 'NS', 'ON', 'PE', 'QC', 'SK', 'YT'], dtype='object', name='Province'),
 Index(['Population', 'Area'], dtype='object')]

In [36]:
province_df.sort_index(axis=1, ascending=True)

             Area  Population
Province
AB        1234567     1234567
BC        2345678     2345678
MB        3456789     3456789
NB        4567890     4567890
NL        5678901     5678901
NT        6789012     6789012
NS        7890123     7890123
ON        8901234     8901234
PE        9012345     9012345
QC         123456      123456
SK        1234567     1234567
YT        2345678     2345678

### heirarchical indexes

In [37]:
h_df = pd.DataFrame([4,7,8,9,10],columns=["data"],index=[["a","a","c","c","e"],["x","y","z","w","v"]])
h_df

     data
a x     4
  y     7
c z     8
  w     9
e v    10

In [38]:
h_df.index

MultiIndex([('a', 'x'),
            ('a', 'y'),
            ('c', 'z'),
            ('c', 'w'),
            ('e', 'v')],
           )

### selecting data from DF

In [39]:
province_df["Population"]

Province
AB    1234567
BC    2345678
MB    3456789
NB    4567890
NL    5678901
NT    6789012
NS    7890123
ON    8901234
PE    9012345
QC     123456
SK    1234567
YT    2345678
Name: Population, dtype: int64

In [40]:
print(province_df["Population"])
print(province_df.Population)
print(province_df.loc["AB"]["Population"])
print(province_df.iloc[0][1])
print(province_df.iat[0,1])

Province
AB    1234567
BC    2345678
MB    3456789
NB    4567890
NL    5678901
NT    6789012
NS    7890123
ON    8901234
PE    9012345
QC     123456
SK    1234567
YT    2345678
Name: Population, dtype: int64
Province
AB    1234567
BC    2345678
MB    3456789
NB    4567890
NL    5678901
NT    6789012
NS    7890123
ON    8901234
PE    9012345
QC     123456
SK    1234567
YT    2345678
Name: Population, dtype: int64
1234567
1234567
1234567

C:\Users\Drashti Trivedi\AppData\Local\Temp\ipykernel_12452\2386871240.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(province_df.iloc[0][1])

In [41]:
print(province_df['Population'] is province_df.Population)
print(province_df['Population'] == province_df.Population)
print(province_df['Population'].equals(province_df.Population))

True
Province
AB    True
BC    True
MB    True
NB    True
NL    True
NT    True
NS    True
ON    True
PE    True
QC    True
SK    True
YT    True
Name: Population, dtype: bool
True

In [42]:
print(type(province_df['Population']))

<class 'pandas.core.series.Series'>

In [43]:
# province_read_csv.2016 # this will throw an error as integer 2016 is not a column name
province_read_csv["2016"]

Province Abbreviation
NL      724
PE      584
NS     3060
NB     2741
QC    21372
ON    21347
MB     3531
SK     1565
AB     5772
BC     6482
YT      946
NT     1281
NU     1539
Name: 2016, dtype: int64

In [44]:
print(province_read_csv.loc["NL"]["2016"])
print(province_read_csv.iloc[4][2])
print(province_read_csv.iat[4,2])
print(province_read_csv[["Province Name", "2016"]])
print(province_read_csv.loc[:,["Province Name", "2016"]])
print(province_read_csv.iloc[:,[1,2]])

724
22720
22720
                                   Province Name   2016
Province Abbreviation
NL                     Newfoundland and Labrador    724
PE                          Prince Edward Island    584
NS                                   Nova Scotia   3060
NB                                 New Brunswick   2741
QC                                        Quebec  21372
ON                                       Ontario  21347
MB                                      Manitoba   3531
SK                                  Saskatchewan   1565
AB                                       Alberta   5772
BC                              British Columbia   6482
YT                                         Yukon    946
NT                         Northwest Territories   1281
NU                                       Nunavut   1539
                                   Province Name   2016
Province Abbreviation
NL                     Newfoundland and Labrador    724
PE                          Prince Edward Island    584
NS                                   Nova Scotia   3060
NB                                 New Brunswick   2741
QC                                        Quebec  21372
ON                                       Ontario  21347
MB                                      Manitoba   3531
SK                                  Saskatchewan   1565
AB                                       Alberta   5772
BC                              British Columbia   6482
YT                                         Yukon    946
NT                         Northwest Territories   1281
NU                                       Nunavut   1539
                        2016   2017
Province Abbreviation
NL                       724    734
PE                       584    601
NS                      3060   3138
NB                      2741   2814
QC                     21372  22720
ON                     21347  21101
MB                      3531   3675
SK                      1565   1613
AB                      5772   5943
BC                      6482   6680
YT                       946    973
NT                      1281   1294
NU                      1539   1583

C:\Users\Drashti Trivedi\AppData\Local\Temp\ipykernel_12452\2943809266.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(province_read_csv.iloc[4][2])

In [45]:
print(province_read_csv.loc["ON"])
print(province_read_csv.loc[["ON", "NB", "NU"]])

Province Name    Ontario
2016               21347
2017               21101
2018               21420
Name: ON, dtype: object
                       Province Name   2016   2017   2018
Province Abbreviation
ON                           Ontario  21347  21101  21420
NB                     New Brunswick   2741   2814   2956
NU                           Nunavut   1539   1583   1634

In [46]:
print(province_read_csv.iloc[9])
print(province_read_csv.iloc[9:11])

Province Name    British Columbia
2016                         6482
2017                         6680
2018                         6925
Name: BC, dtype: object
                          Province Name  2016  2017  2018
Province Abbreviation
BC                     British Columbia  6482  6680  6925
YT                                Yukon   946   973  1006

In [47]:
print(province_read_csv.iloc[9:11, 1:]) # this will print rows 9 and 10 and columns 1 and 2
print(province_read_csv.loc[:"NS", :"2016"])

                       2016  2017  2018
Province Abbreviation
BC                     6482  6680  6925
YT                      946   973  1006
                                   Province Name  2016
Province Abbreviation
NL                     Newfoundland and Labrador   724
PE                          Prince Edward Island   584
NS                                   Nova Scotia  3060

In [48]:
print(province_read_csv[province_read_csv.index.isin(["ON", "BC", "BS"])])

                          Province Name   2016   2017   2018
Province Abbreviation
ON                              Ontario  21347  21101  21420
BC                     British Columbia   6482   6680   6925

In [49]:
province_read_csv[province_read_csv['2016'].isin([724, 3060, 21372])]

                                   Province Name   2016   2017   2018
Province Abbreviation
NL                     Newfoundland and Labrador    724    734    750
NS                                   Nova Scotia   3060   3138   3201
QC                                        Quebec  21372  22720  23749

In [50]:
province_read_csv[(province_read_csv['2016'] > 10000) & (province_read_csv.index.isin(["ON", "BC", "BS"]))]

                      Province Name   2016   2017   2018
Province Abbreviation
ON                          Ontario  21347  21101  21420

### ~ is not unary operator

In [51]:
province_read_csv[~(province_read_csv['2017'] > 10000)]

# OR

province_read_csv[province_read_csv['2017'] <= 10000]

                                   Province Name  2016  2017  2018
Province Abbreviation
NL                     Newfoundland and Labrador   724   734   750
PE                          Prince Edward Island   584   601   638
NS                                   Nova Scotia  3060  3138  3201
NB                                 New Brunswick  2741  2814  2956
MB                                      Manitoba  3531  3675  3965
SK                                  Saskatchewan  1565  1613  1673
AB                                       Alberta  5772  5943  6157
BC                              British Columbia  6482  6680  6925
YT                                         Yukon   946   973  1006
NT                         Northwest Territories  1281  1294  1319
NU                                       Nunavut  1539  1583  1634

### Pandas str methods

In [52]:
print(province_read_csv["Province Name"].str.upper())
print(province_read_csv["Province Name"].str.lower())
print(province_read_csv["Province Name"].str.title())
print(province_read_csv["Province Name"].str.capitalize())
print(province_read_csv["Province Name"].str.swapcase())

Province Abbreviation
NL    NEWFOUNDLAND AND LABRADOR
PE         PRINCE EDWARD ISLAND
NS                  NOVA SCOTIA
NB                NEW BRUNSWICK
QC                       QUEBEC
ON                      ONTARIO
MB                     MANITOBA
SK                 SASKATCHEWAN
AB                      ALBERTA
BC             BRITISH COLUMBIA
YT                        YUKON
NT        NORTHWEST TERRITORIES
NU                      NUNAVUT
Name: Province Name, dtype: object
Province Abbreviation
NL    newfoundland and labrador
PE         prince edward island
NS                  nova scotia
NB                new brunswick
QC                       quebec
ON                      ontario
MB                     manitoba
SK                 saskatchewan
AB                      alberta
BC             british columbia
YT                        yukon
NT        northwest territories
NU                      nunavut
Name: Province Name, dtype: object
Province Abbreviation
NL    Newfoundland And Labrador
PE         Prince Edward Island
NS                  Nova Scotia
NB                New Brunswick
QC                       Quebec
ON                      Ontario
MB                     Manitoba
SK                 Saskatchewan
AB                      Alberta
BC             British Columbia
YT                        Yukon
NT        Northwest Territories
NU                      Nunavut
Name: Province Name, dtype: object
Province Abbreviation
NL    Newfoundland and labrador
PE         Prince edward island
NS                  Nova scotia
NB                New brunswick
QC                       Quebec
ON                      Ontario
MB                     Manitoba
SK                 Saskatchewan
AB                      Alberta
BC             British columbia
YT                        Yukon
NT        Northwest territories
NU                      Nunavut
Name: Province Name, dtype: object
Province Abbreviation
NL    nEWFOUNDLAND AND lABRADOR
PE         pRINCE eDWARD iSLAND
NS                  nOVA sCOTIA
NB                nEW bRUNSWICK
QC                       qUEBEC
ON                      oNTARIO
MB                     mANITOBA
SK                 sASKATCHEWAN
AB                      aLBERTA
BC             bRITISH cOLUMBIA
YT                        yUKON
NT        nORTHWEST tERRITORIES
NU                      nUNAVUT
Name: Province Name, dtype: object

In [53]:

print(province_read_csv["Province Name"].str.len())

Province Abbreviation
NL    25
PE    20
NS    11
NB    13
QC     6
ON     7
MB     8
SK    12
AB     7
BC    16
YT     5
NT    21
NU     7
Name: Province Name, dtype: int64

In [54]:

print(province_read_csv[province_read_csv["Province Name"].str.startswith("N")]["Province Name"])
print(province_read_csv[province_read_csv["Province Name"].str.endswith("a")]["Province Name"])

Province Abbreviation
NL    Newfoundland and Labrador
NS                  Nova Scotia
NB                New Brunswick
NT        Northwest Territories
NU                      Nunavut
Name: Province Name, dtype: object
Province Abbreviation
NS         Nova Scotia
MB            Manitoba
AB             Alberta
BC    British Columbia
Name: Province Name, dtype: object

In [55]:

print(province_read_csv["Province Name"].str.count("a"))
print(province_read_csv["Province Name"].str.find("a"))

Province Abbreviation
NL    4
PE    2
NS    2
NB    0
QC    0
ON    1
MB    2
SK    3
AB    1
BC    1
YT    0
NT    0
NU    1
Name: Province Name, dtype: int64
Province Abbreviation
NL     9
PE    10
NS     3
NB    -1
QC    -1
ON     3
MB     1
SK     1
AB     6
BC    15
YT    -1
NT    -1
NU     3
Name: Province Name, dtype: int64

In [56]:

print(province_read_csv["Province Name"].str.rfind("a"))
print(province_read_csv["Province Name"].str.replace("a", "A"))

Province Abbreviation
NL    21
PE    17
NS    10
NB    -1
QC    -1
ON     3
MB     7
SK    10
AB     6
BC    15
YT    -1
NT    -1
NU     3
Name: Province Name, dtype: int64
Province Abbreviation
NL    NewfoundlAnd And LAbrAdor
PE         Prince EdwArd IslAnd
NS                  NovA ScotiA
NB                New Brunswick
QC                       Quebec
ON                      OntArio
MB                     MAnitobA
SK                 SAskAtchewAn
AB                      AlbertA
BC             British ColumbiA
YT                        Yukon
NT        Northwest Territories
NU                      NunAvut
Name: Province Name, dtype: object

In [57]:

print(province_read_csv["Province Name"].str.split(" "))
print(province_read_csv["Province Name"].str.split(" ", expand=True))

Province Abbreviation
NL    [Newfoundland, and, Labrador]
PE         [Prince, Edward, Island]
NS                   [Nova, Scotia]
NB                 [New, Brunswick]
QC                         [Quebec]
ON                        [Ontario]
MB                       [Manitoba]
SK                   [Saskatchewan]
AB                        [Alberta]
BC              [British, Columbia]
YT                          [Yukon]
NT         [Northwest, Territories]
NU                        [Nunavut]
Name: Province Name, dtype: object
                                  0            1         2
Province Abbreviation
NL                     Newfoundland          and  Labrador
PE                           Prince       Edward    Island
NS                             Nova       Scotia      None
NB                              New    Brunswick      None
QC                           Quebec         None      None
ON                          Ontario         None      None
MB                         Manitoba         None      None
SK                     Saskatchewan         None      None
AB                          Alberta         None      None
BC                          British     Columbia      None
YT                            Yukon         None      None
NT                        Northwest  Territories      None
NU                          Nunavut         None      None

In [58]:
province_read_csv['2-16-2018 change'] = province_read_csv['2018'] - province_read_csv['2016']
province_read_csv

,Province Name,2016,2017,2018,2-16-2018 change
Province Abbreviation,,,,,
NL,Newfoundland and Labrador,724,734,750,26
PE,Prince Edward Island,584,601,638,54
NS,Nova Scotia,3060,3138,3201,141
NB,New Brunswick,2741,2814,2956,215
QC,Quebec,21372,22720,23749,2377
ON,Ontario,21347,21101,21420,73
MB,Manitoba,3531,3675,3965,434
SK,Saskatchewan,1565,1613,1673,108
AB,Alberta,5772,5943,6157,385
BC,British Columbia,6482,6680,6925,443
YT,Yukon,946,973,1006,60
NT,Northwest Territories,1281,1294,1319,38
NU,Nunavut,1539,1583,1634,95

In [59]:
params["BMI"] = params["Weight"] / (params["Height"] ** 2)
params

   Age  Height  Weight       BMI
0   21     5.9     120  3.447285
1   22     6.0     130  3.611111
2   23     6.1     140  3.762429
3   24     6.2     150  3.902185
4   25     6.3     160  4.031242

In [60]:
# del params[(0, "Age")]
params

   Age  Height  Weight       BMI
0   21     5.9     120  3.447285
1   22     6.0     130  3.611111
2   23     6.1     140  3.762429
3   24     6.2     150  3.902185
4   25     6.3     160  4.031242

In [61]:
params.loc[0, "Age"] = 20
params

   Age  Height  Weight       BMI
0   20     5.9     120  3.447285
1   22     6.0     130  3.611111
2   23     6.1     140  3.762429
3   24     6.2     150  3.902185
4   25     6.3     160  4.031242

In [62]:
params.at[1, "Height"]

6.0

In [63]:
province_read_csv.drop(["ON", "NB"])

,Province Name,2016,2017,2018,2-16-2018 change
Province Abbreviation,,,,,
NL,Newfoundland and Labrador,724,734,750,26
PE,Prince Edward Island,584,601,638,54
NS,Nova Scotia,3060,3138,3201,141
QC,Quebec,21372,22720,23749,2377
MB,Manitoba,3531,3675,3965,434
SK,Saskatchewan,1565,1613,1673,108
AB,Alberta,5772,5943,6157,385
BC,British Columbia,6482,6680,6925,443
YT,Yukon,946,973,1006,60
NT,Northwest Territories,1281,1294,1319,38
NU,Nunavut,1539,1583,1634,95

In [64]:
province_read_csv

,Province Name,2016,2017,2018,2-16-2018 change
Province Abbreviation,,,,,
NL,Newfoundland and Labrador,724,734,750,26
PE,Prince Edward Island,584,601,638,54
NS,Nova Scotia,3060,3138,3201,141
NB,New Brunswick,2741,2814,2956,215
QC,Quebec,21372,22720,23749,2377
ON,Ontario,21347,21101,21420,73
MB,Manitoba,3531,3675,3965,434
SK,Saskatchewan,1565,1613,1673,108
AB,Alberta,5772,5943,6157,385
BC,British Columbia,6482,6680,6925,443
YT,Yukon,946,973,1006,60
NT,Northwest Territories,1281,1294,1319,38
NU,Nunavut,1539,1583,1634,95

In [65]:
province_read_csv.drop(["ON", "NB"], inplace=True)
province_read_csv

,Province Name,2016,2017,2018,2-16-2018 change
Province Abbreviation,,,,,
NL,Newfoundland and Labrador,724,734,750,26
PE,Prince Edward Island,584,601,638,54
NS,Nova Scotia,3060,3138,3201,141
QC,Quebec,21372,22720,23749,2377
MB,Manitoba,3531,3675,3965,434
SK,Saskatchewan,1565,1613,1673,108
AB,Alberta,5772,5943,6157,385
BC,British Columbia,6482,6680,6925,443
YT,Yukon,946,973,1006,60
NT,Northwest Territories,1281,1294,1319,38
NU,Nunavut,1539,1583,1634,95

In [66]:
province_read_csv

,Province Name,2016,2017,2018,2-16-2018 change
Province Abbreviation,,,,,
NL,Newfoundland and Labrador,724,734,750,26
PE,Prince Edward Island,584,601,638,54
NS,Nova Scotia,3060,3138,3201,141
QC,Quebec,21372,22720,23749,2377
MB,Manitoba,3531,3675,3965,434
SK,Saskatchewan,1565,1613,1673,108
AB,Alberta,5772,5943,6157,385
BC,British Columbia,6482,6680,6925,443
YT,Yukon,946,973,1006,60
NT,Northwest Territories,1281,1294,1319,38
NU,Nunavut,1539,1583,1634,95

In [67]:
province_read_csv.sort_values("Province Name")

,Province Name,2016,2017,2018,2-16-2018 change
Province Abbreviation,,,,,
AB,Alberta,5772,5943,6157,385
BC,British Columbia,6482,6680,6925,443
MB,Manitoba,3531,3675,3965,434
NL,Newfoundland and Labrador,724,734,750,26
NT,Northwest Territories,1281,1294,1319,38
NS,Nova Scotia,3060,3138,3201,141
NU,Nunavut,1539,1583,1634,95
PE,Prince Edward Island,584,601,638,54
QC,Quebec,21372,22720,23749,2377
SK,Saskatchewan,1565,1613,1673,108
YT,Yukon,946,973,1006,60

In [68]:
params.loc[0, "Age"] = 30
params

   Age  Height  Weight       BMI
0   30     5.9     120  3.447285
1   22     6.0     130  3.611111
2   23     6.1     140  3.762429
3   24     6.2     150  3.902185
4   25     6.3     160  4.031242

In [69]:
params

   Age  Height  Weight       BMI
0   30     5.9     120  3.447285
1   22     6.0     130  3.611111
2   23     6.1     140  3.762429
3   24     6.2     150  3.902185
4   25     6.3     160  4.031242

In [70]:
params.sort_index()

   Age  Height  Weight       BMI
0   30     5.9     120  3.447285
1   22     6.0     130  3.611111
2   23     6.1     140  3.762429
3   24     6.2     150  3.902185
4   25     6.3     160  4.031242

In [71]:
params.set_axis(["Height", "Weight", "BMI"], axis=1)

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements

In [ ]:
print(df.to_string())
print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45
day4       400        46
day5       410        47
day6       420        48
      calories  duration
day1       420        50
day2       380        40
day3       390        45
day4       400        46
day5       410        47
day6       420        48

In [ ]:
pd.options.display.max_rows

60

## read JSON

In [ ]:
json_df = pd.read_json("data.json")
json_df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

## Data Cleaning
Data cleaning means fixing bad data in your data set.

Bad data could be:

Empty cells

Data in wrong format

Wrong data

Duplicates

In [ ]:
new_df = pd.read_csv("data.csv")
new_df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [ ]:
new_df.dropna(inplace=True)
new_df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [ ]:
new_df['Calories'] = new_df['Calories'].fillna(130)
new_df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [ ]:
print(new_df['Calories'].mean())
print(new_df['Calories'].median())
print(new_df['Calories'].mode())
print(new_df['Calories'].std())
print(new_df['Calories'].var())

375.79024390243904
318.6
0    300.0
Name: Calories, dtype: float64
266.37991924435164
70958.2613766273

In [ ]:
print(new_df[new_df['Calories'].isna()])

Empty DataFrame
Columns: [Duration, Pulse, Maxpulse, Calories]
Index: []

In [ ]:
date_df = pd.read_csv("date.csv")
date_df.dropna(inplace=True)
date_df

   ID    Duration   Date        Pulse    Maxpulse  Calories
0     0         60  '2020/12/01'    110       130 ...
1     1         60  '2020/12/02'    117       145 ...
2     2         60  '2020/12/03'    103       135 ...
3     3         45  '2020/12/04'    109       175 ...
4     4         45  '2020/12/05'    117       148 ...
5     5         60  '2020/12/06'    102       127 ...
6     6         60  '2020/12/07'    110       136 ...
7     7        450  '2020/12/08'    104       134 ...
8     8         30  '2020/12/09'    109       133 ...
9     9         60  '2020/12/10'     98       124 ...
10    10        60  '2020/12/11'    103       147 ...
11    11        60  '2020/12/12'    100       120 ...
12    12        60  '2020/12/12'    100       120 ...
13    13        60  '2020/12/13'    106       128 ...
14    14        60  '2020/12/14'    104       132 ...
15    15        60  '2020/12/15'     98       123 ...
16    16        60  '2020/12/16'     98       120 ...
17    17        60  '2020/12/17'    100       120 ...
18    18        45  '2020/12/18'     90       112 ...
19    19        60  '2020/12/19'    103       123 ...
20    20        45  '2020/12/20'     97       125 ...
21    21        60  '2020/12/21'    108       131 ...
22    22        45           NaN    100       119 ...
23    23        60  '2020/12/23'    130       101 ...
24    24        45  '2020/12/24'    105       132 ...
25    25        60  '2020/12/25'    102       126 ...
26    26        60    2020/12/26    100       120 ...
27    27        60  '2020/12/27'     92       118 ...
28    28        60  '2020/12/28'    103       132 ...
29    29        60  '2020/12/29'    100       132 ...
30    30        60  '2020/12/30'    102       129 ...
31    31        60  '2020/12/31'     92       115 ...

In [ ]:
# date_df['Date'] = pd.to_datetime(date_df['Date'])
date_df

   ID    Duration   Date        Pulse    Maxpulse  Calories
0     0         60  '2020/12/01'    110       130 ...
1     1         60  '2020/12/02'    117       145 ...
2     2         60  '2020/12/03'    103       135 ...
3     3         45  '2020/12/04'    109       175 ...
4     4         45  '2020/12/05'    117       148 ...
5     5         60  '2020/12/06'    102       127 ...
6     6         60  '2020/12/07'    110       136 ...
7     7        450  '2020/12/08'    104       134 ...
8     8         30  '2020/12/09'    109       133 ...
9     9         60  '2020/12/10'     98       124 ...
10    10        60  '2020/12/11'    103       147 ...
11    11        60  '2020/12/12'    100       120 ...
12    12        60  '2020/12/12'    100       120 ...
13    13        60  '2020/12/13'    106       128 ...
14    14        60  '2020/12/14'    104       132 ...
15    15        60  '2020/12/15'     98       123 ...
16    16        60  '2020/12/16'     98       120 ...
17    17        60  '2020/12/17'    100       120 ...
18    18        45  '2020/12/18'     90       112 ...
19    19        60  '2020/12/19'    103       123 ...
20    20        45  '2020/12/20'     97       125 ...
21    21        60  '2020/12/21'    108       131 ...
22    22        45           NaN    100       119 ...
23    23        60  '2020/12/23'    130       101 ...
24    24        45  '2020/12/24'    105       132 ...
25    25        60  '2020/12/25'    102       126 ...
26    26        60    2020/12/26    100       120 ...
27    27        60  '2020/12/27'     92       118 ...
28    28        60  '2020/12/28'    103       132 ...
29    29        60  '2020/12/29'    100       132 ...
30    30        60  '2020/12/30'    102       129 ...
31    31        60  '2020/12/31'     92       115 ...

In [ ]:
date_df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
dtype: bool

In [ ]:
new_df.corr()

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.160661  0.005679  0.922717
Pulse    -0.160661  1.000000  0.784631  0.025121
Maxpulse  0.005679  0.784631  1.000000  0.203813
Calories  0.922717  0.025121  0.203813  1.000000

## Merge, Join, compare and concatenate

In [ ]:
df1 = pd.DataFrame(
        {
            "A": ["A0", "A1", "A2", "A3"],
            "B": ["B0", "B1", "B2", "B3"],
            "C": ["C0", "C1", "C2", "C3"],
            "D": ["D0", "D1", "D2", "D3"],
        },
        index=[0, 1, 2, 3],
    )
    

df2 = pd.DataFrame(
     {
         "A": ["A4", "A5", "A6", "A7"],
         "B": ["B4", "B5", "B6", "B7"],
         "C": ["C4", "C5", "C6", "C7"],
         "D": ["D4", "D5", "D6", "D7"],
     },
     index=[4, 5, 6, 7],
 )
 

df3 = pd.DataFrame(
     {
         "A": ["A8", "A9", "A10", "A11"],
         "B": ["B8", "B9", "B10", "B11"],
         "C": ["C8", "C9", "C10", "C11"],
         "D": ["D8", "D9", "D10", "D11"],
     },
     index=[8, 9, 10, 11],
 )

frames = [df1, df2, df3]

result = pd.concat(frames)

result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
df4 = pd.DataFrame(
      {
          "B": ["B2", "B3", "B6", "B7"],
          "D": ["D2", "D3", "D6", "D7"],
          "F": ["F2", "F3", "F6", "F7"],
      },
      index=[2, 3, 6, 7],
  )
  

result = pd.concat([df1, df4], axis=0)

print("axis = 0") # axis = 0 means, DOWN COLUMNS are concatenated, so concatenation along rows
print(result)

result = pd.concat([df1, df4], axis=1) # axis = 1 means, across rows, so concatenation along columns
print("axis 1" )
print(result)

axis = 0
     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7
axis 1
     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

### join = "inner" takes the intersection of the axis values

In [ ]:
inner_d = pd.concat([df1, df4], join="inner")
print(inner_d) # this will give us the intersection of the two dataframes

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

In [ ]:
inner_df = pd.concat([df1, df4], join="inner", axis=1)
print(inner_df)

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [ ]:
print(pd.concat([df1, df4], axis=1))
print(pd.concat([df1, df4], axis = 1).reindex(df1.index)) # perform effective left join 
print(pd.concat([df1, df4], axis = 1).reindex(df4.index)) # perform effective right join

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7
    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3
     A    B    C    D   B   D   F
2   A2   B2   C2   D2  B2  D2  F2
3   A3   B3   C3   D3  B3  D3  F3
6  NaN  NaN  NaN  NaN  B6  D6  F6
7  NaN  NaN  NaN  NaN  B7  D7  F7

In [ ]:
print(pd.concat([df1, df4], axis=1, ignore_index=True)) # ignore index for columns cuz axis = 1

     0    1    2    3    4    5    6
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [ ]:
print(pd.concat([df1, df4], axis=0))

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [ ]:
print(pd.concat([df1,df4], axis=0, keys=["df1", "df4"]))

         A   B    C   D    F
df1 0   A0  B0   C0  D0  NaN
    1   A1  B1   C1  D1  NaN
    2   A2  B2   C2  D2  NaN
    3   A3  B3   C3  D3  NaN
df4 2  NaN  B2  NaN  D2   F2
    3  NaN  B3  NaN  D3   F3
    6  NaN  B6  NaN  D6   F6
    7  NaN  B7  NaN  D7   F7

## concating DF and series together

In [ ]:
s1 = pd.Series(["X0", "X1", "X2", "X3"], name="X")

result = pd.concat([df1, s1])

print(result)

result = pd.concat([df1, s1], axis=1)

print(result)

     A    B    C    D    X
0   A0   B0   C0   D0  NaN
1   A1   B1   C1   D1  NaN
2   A2   B2   C2   D2  NaN
3   A3   B3   C3   D3  NaN
0  NaN  NaN  NaN  NaN   X0
1  NaN  NaN  NaN  NaN   X1
2  NaN  NaN  NaN  NaN   X2
3  NaN  NaN  NaN  NaN   X3
    A   B   C   D   X
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

## Unnamed Series will be numbered consecutively.

In [ ]:
s2 = pd.Series(["_0", "_1", "_2", "_3"])

result = pd.concat([df1, s2])
print(result)

result = pd.concat([df1, s2], axis=1)
print(result)

     A    B    C    D    0
0   A0   B0   C0   D0  NaN
1   A1   B1   C1   D1  NaN
2   A2   B2   C2   D2  NaN
3   A3   B3   C3   D3  NaN
0  NaN  NaN  NaN  NaN   _0
1  NaN  NaN  NaN  NaN   _1
2  NaN  NaN  NaN  NaN   _2
3  NaN  NaN  NaN  NaN   _3
    A   B   C   D   0
0  A0  B0  C0  D0  _0
1  A1  B1  C1  D1  _1
2  A2  B2  C2  D2  _2
3  A3  B3  C3  D3  _3

In [ ]:
s3 = pd.Series([0, 1, 2, 3], name="foo")

s4 = pd.Series([0, 1, 2, 3])

s5 = pd.Series([0, 1, 4, 5])

print(pd.concat([s3, s4, s5], axis=0))
print(pd.concat([s3, s4, s5], axis=1))

0    0
1    1
2    2
3    3
0    0
1    1
2    2
3    3
0    0
1    1
2    4
3    5
dtype: int64
   foo  0  1
0    0  0  0
1    1  1  1
2    2  2  4
3    3  3  5

In [ ]:
print(pd.concat([s3, s4, s5], axis=0, keys=["s3", "s4", "s5"]))
print(pd.concat([s3, s4, s5], axis=1, keys=["s3", "s4", "s5"]))

s3  0    0
    1    1
    2    2
    3    3
s4  0    0
    1    1
    2    2
    3    3
s5  0    0
    1    1
    2    4
    3    5
dtype: int64
   s3  s4  s5
0   0   0   0
1   1   1   1
2   2   2   4
3   3   3   5

In [ ]:
pieces = {"x": df1, "y": df2, "z": df3}
print(pd.concat(pieces))
print(pd.concat(pieces, keys=["x", "y", "z"]))
print(pd.concat(pieces, keys=["z", "y"]))

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11
        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11
        A    B    C    D
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7

## Merge types
merge() implements common SQL style joining operations.

- one-to-one: joining two DataFrame objects on their indexes which must contain unique values.

- many-to-one: joining a unique index to one or more columns in a different DataFrame.

- many-to-many : joining columns on columns.

Merge method and SQL Join Name

- left - LEFT OUTER JOIN - Use keys from left frame only

- right - RIGHT OUTER JOIN - Use keys from right frame only

- outer - FULL OUTER JOIN - Use union of keys from both frames

- inner - INNER JOIN - Use intersection of keys from both frames

- cross - CROSS JOIN - Create the cartesian product of rows of both frames

In [ ]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3", "K4"],
        "A": ["A0", "A1", "A2", "A3", "A4"],
        "B": ["B0", "B1", "B2", "B3", "B4"],
    }
)


right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3", "K5"],
        "C": ["C0", "C1", "C2", "C3", "C5"],
        "D": ["D0", "D1", "D2", "D3", "D5"],
    }
)

result = pd.merge(left, right, on="key")
print(result)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
print(pd.merge(left, right, how="left", on="key"))

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3
4  K4  A4  B4  NaN  NaN

In [ ]:
print(pd.merge(left, right, how="right", on="key"))

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3
4  K5  NaN  NaN  C5  D5

In [ ]:
print(pd.merge(left, right, how="outer", on="key"))

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4   A4   B4  NaN  NaN
5  K5  NaN  NaN   C5   D5

In [ ]:
print(pd.merge(left, right, how="inner", on="key"))

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
print(pd.merge(left, right, how="cross")) # this will give us the cartesian product means left x right

   key_x   A   B key_y   C   D
0     K0  A0  B0    K0  C0  D0
1     K0  A0  B0    K1  C1  D1
2     K0  A0  B0    K2  C2  D2
3     K0  A0  B0    K3  C3  D3
4     K0  A0  B0    K5  C5  D5
5     K1  A1  B1    K0  C0  D0
6     K1  A1  B1    K1  C1  D1
7     K1  A1  B1    K2  C2  D2
8     K1  A1  B1    K3  C3  D3
9     K1  A1  B1    K5  C5  D5
10    K2  A2  B2    K0  C0  D0
11    K2  A2  B2    K1  C1  D1
12    K2  A2  B2    K2  C2  D2
13    K2  A2  B2    K3  C3  D3
14    K2  A2  B2    K5  C5  D5
15    K3  A3  B3    K0  C0  D0
16    K3  A3  B3    K1  C1  D1
17    K3  A3  B3    K2  C2  D2
18    K3  A3  B3    K3  C3  D3
19    K3  A3  B3    K5  C5  D5
20    K4  A4  B4    K0  C0  D0
21    K4  A4  B4    K1  C1  D1
22    K4  A4  B4    K2  C2  D2
23    K4  A4  B4    K3  C3  D3
24    K4  A4  B4    K5  C5  D5

In [ ]:
print(pd.merge(right, left, how="cross")) # this will give us the cartesian product means right x left

   key_x   C   D key_y   A   B
0     K0  C0  D0    K0  A0  B0
1     K0  C0  D0    K1  A1  B1
2     K0  C0  D0    K2  A2  B2
3     K0  C0  D0    K3  A3  B3
4     K0  C0  D0    K4  A4  B4
5     K1  C1  D1    K0  A0  B0
6     K1  C1  D1    K1  A1  B1
7     K1  C1  D1    K2  A2  B2
8     K1  C1  D1    K3  A3  B3
9     K1  C1  D1    K4  A4  B4
10    K2  C2  D2    K0  A0  B0
11    K2  C2  D2    K1  A1  B1
12    K2  C2  D2    K2  A2  B2
13    K2  C2  D2    K3  A3  B3
14    K2  C2  D2    K4  A4  B4
15    K3  C3  D3    K0  A0  B0
16    K3  C3  D3    K1  A1  B1
17    K3  C3  D3    K2  A2  B2
18    K3  C3  D3    K3  A3  B3
19    K3  C3  D3    K4  A4  B4
20    K5  C5  D5    K0  A0  B0
21    K5  C5  D5    K1  A1  B1
22    K5  C5  D5    K2  A2  B2
23    K5  C5  D5    K3  A3  B3
24    K5  C5  D5    K4  A4  B4

## DataFrame.join()

In [ ]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)


right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

print(left.join(right)) 
print(right.join(left))

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [ ]:
print(left.join(right, how="inner")) # inner join, intersection from left and right

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [ ]:
print(left.join(right, how="outer")) # outer join, union from left and right

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
print(left.join(right, how="left")) # left join, left table values are preserved but the right table may have NaN values for values that couldn't join

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
print(left.join(right, how="right")) # right join, right table values are preserved but the left table may have NaN values for values that couldn't join

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [ ]:
print(left.join(right, how="cross", lsuffix="_left", rsuffix="_right")) # cross join, cartesian product of left and right

    A   B   C   D
0  A0  B0  C0  D0
1  A0  B0  C2  D2
2  A0  B0  C3  D3
3  A1  B1  C0  D0
4  A1  B1  C2  D2
5  A1  B1  C3  D3
6  A2  B2  C0  D0
7  A2  B2  C2  D2
8  A2  B2  C3  D3

## DataFrame.transform(func, axis=0, *args, **kwargs)

In [ ]:
df = pd.DataFrame({'A': range(3), 'B': range(1, 4)})
df

   A  B
0  0  1
1  1  2
2  2  3

In [ ]:
df.transform(lambda x : x + 1)

   A  B
0  1  2
1  2  3
2  3  4

In [ ]:
df.transform([np.sqrt, np.exp])

          A                   B
       sqrt       exp      sqrt        exp
0  0.000000  1.000000  1.000000   2.718282
1  1.000000  2.718282  1.414214   7.389056
2  1.414214  7.389056  1.732051  20.085537

In [ ]:
df = pd.DataFrame({
    "Date": [
        "2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05",
        "2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05"],
    "Data": [5, 8, 6, 1, 50, 100, 60, 120],
})
df

         Date  Data
0  2015-05-08     5
1  2015-05-07     8
2  2015-05-06     6
3  2015-05-05     1
4  2015-05-08    50
5  2015-05-07   100
6  2015-05-06    60
7  2015-05-05   120

In [ ]:
df.groupby(['Date']).transform('sum')

   Data
0    55
1   108
2    66
3   121
4    55
5   108
6    66
7   121

In [ ]:
df = pd.DataFrame({
    "c": [1, 1, 1, 2, 2, 2, 2],
    "type": ["m", "n", "o", "m", "m", "n", "n"]
})
df

   c type
0  1    m
1  1    n
2  1    o
3  2    m
4  2    m
5  2    n
6  2    n

In [ ]:
df['size'] = df.groupby('c')['type'].transform(len)
df

   c type  size
0  1    m     3
1  1    n     3
2  1    o     3
3  2    m     4
4  2    m     4
5  2    n     4
6  2    n     4

## pandas.DataFrame.aggregate
DataFrame.aggregate(func=None, axis=0, *args, **kwargs)

In [ ]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [ ]:
df.agg(['sum','mean'])

         A     B     C
sum   12.0  15.0  18.0
mean   4.0   5.0   6.0

### different agg per column

In [ ]:
df.agg({'A': ['sum', 'min'], 'B': ['min', 'max']})

        A    B
sum  12.0  NaN
min   1.0  2.0
max   NaN  8.0

### Aggregate different functions over the columns and rename the index of the resulting DataFrame.

In [ ]:
df.agg(x=('A', 'min'), y=('B', 'sum'))

     A     B
x  1.0   NaN
y  NaN  15.0

### Aggregate over the columns.

In [ ]:
df.agg('mean', axis="columns")

0    2.0
1    5.0
2    8.0
3    NaN
dtype: float64

In [ ]:
df.agg('sum', axis=1)

0     6.0
1    15.0
2    24.0
3     0.0
dtype: float64

In [ ]:
df.agg('sum', axis=0)

A    12.0
B    15.0
C    18.0
dtype: float64

## diff(periods=1, axis=0) - Calculates the difference of a DataFrame element compared with another element in the DataFrame (default is element in previous row).

In [ ]:
df = pd.DataFrame({'a': [1, 2, 3, 4, 5, 6],
                   'b': [1, 1, 2, 3, 5, 8],
                   'c': [1, 4, 9, 16, 25, 36]})
df

   a  b   c
0  1  1   1
1  2  1   4
2  3  2   9
3  4  3  16
4  5  5  25
5  6  8  36

In [ ]:
# Difference with previous row
df.diff()

     a    b     c
0  NaN  NaN   NaN
1  1.0  0.0   3.0
2  1.0  1.0   5.0
3  1.0  1.0   7.0
4  1.0  2.0   9.0
5  1.0  3.0  11.0

In [ ]:
# Difference with previous column
df.diff(axis=1)

    a  b   c
0 NaN  0   0
1 NaN -1   3
2 NaN -1   7
3 NaN -1  13
4 NaN  0  20
5 NaN  2  28

In [ ]:
# Difference with 3rd previous row
df.diff(periods=3)

     a    b     c
0  NaN  NaN   NaN
1  NaN  NaN   NaN
2  NaN  NaN   NaN
3  3.0  2.0  15.0
4  3.0  4.0  21.0
5  3.0  6.0  27.0

In [ ]:
# Difference with following row
df.diff(periods=-1)

     a    b     c
0 -1.0  0.0  -3.0
1 -1.0 -1.0  -5.0
2 -1.0 -1.0  -7.0
3 -1.0 -2.0  -9.0
4 -1.0 -3.0 -11.0
5  NaN  NaN   NaN

In [74]:
data = {'A': [1, 2], 'B': [3, 4], 'C': ['NaN', 6]}
df = pd.DataFrame(data)
df

   A  B    C
0  1  3  NaN
1  2  4    6

In [79]:
df['C'] = df['C'].replace('NaN', np.nan)
df

C:\Users\Drashti Trivedi\AppData\Local\Temp\ipykernel_12452\1599291671.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['C'] = df['C'].replace('NaN', np.nan)

   A  B    C
0  1  3  NaN
1  2  4  6.0

In [80]:
df.dropna()

   A  B    C
1  2  4  6.0

In [82]:
df.drop('C', axis=1)

   A  B
0  1  3
1  2  4

In [83]:
df

   A  B    C
0  1  3  NaN
1  2  4  6.0

In [84]:
df.drop('C', axis=1, inplace=True)

In [85]:
df

   A  B
0  1  3
1  2  4

In [86]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [90]:
df.reset_index(drop=True)

   A  B
0  1  3
1  2  4

In [92]:
df[['A','B']].apply(lambda x : x['A'] + x['B'], axis=1)

0    4
1    6
dtype: int64

#### apply() - dataframe.apply(func, axis, raw, result_type, args, kwds) 
A DataFrame or a Series object, with the changes.

This function does NOT make changes to the original DataFrame object.

In [115]:
data = {
  "x": [50, 40, 30],
  "y": [300, 1112, 42]
}

df = pd.DataFrame(data)
df

    x     y
0  50   300
1  40  1112
2  30    42

In [ ]:
def calc_sum(x):
    return x.sum()

df.apply(calc_sum)

x     120
y    1454
dtype: int64

In [117]:
df

    x     y
0  50   300
1  40  1112
2  30    42

### duplicated - returns True for duplicate rows 
### drop_duplicates() - drop duplicate rows

In [119]:
data = {
  "name": ["Sally", "Mary", "John", "Mary"],
  "age": [50, 40, 30, 40],
  "qualified": [True, False, False, False]
}

df = pd.DataFrame(data)
df

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False
3   Mary   40      False

In [120]:
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [124]:
df.drop_duplicates(inplace=True)

In [125]:
df

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False

### astype()

In [126]:

data = {
  "Duration": [50, 40, 45],
  "Pulse": [109, 117, 110],
  "Calories": [409.1, 479.5, 340.8]
}

df = pd.DataFrame(data)
df

   Duration  Pulse  Calories
0        50    109     409.1
1        40    117     479.5
2        45    110     340.8

In [127]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  3 non-null      int64
 1   Pulse     3 non-null      int64
 2   Calories  3 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 204.0 bytes

In [ ]:
df.astype('int32')

   Duration  Pulse  Calories
0        50    109       409
1        40    117       479
2        45    110       340

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  3 non-null      int64
 1   Pulse     3 non-null      int64
 2   Calories  3 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 204.0 bytes

In [130]:
newdf = df.astype('int32')
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  3 non-null      int32
 1   Pulse     3 non-null      int32
 2   Calories  3 non-null      int32
dtypes: int32(3)
memory usage: 168.0 bytes

In [131]:
df['Calories'] = df.Calories.astype('int64')
df

   Duration  Pulse  Calories
0        50    109       409
1        40    117       479
2        45    110       340

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  3 non-null      int64
 1   Pulse     3 non-null      int64
 2   Calories  3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

## Stacking and Unstacking

In [179]:
# Convert between wide and long formats.

# Starting with a wide DataFrame
wide_df = pd.DataFrame({
    ('Electronics', 'Phones'): [100, 120],
    ('Electronics', 'Laptops'): [200, 180],
    ('Clothing', 'Shirts'): [150, 160]
})

wide_df

  Electronics         Clothing
       Phones Laptops   Shirts
0         100     200      150
1         120     180      160

In [181]:
# Stack to long format

long = wide_df.stack()
long

C:\Users\Drashti Trivedi\AppData\Local\Temp\ipykernel_12452\1898165210.py:3: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  long = wide_df.stack()

           Electronics  Clothing
0 Laptops        200.0       NaN
  Phones         100.0       NaN
  Shirts           NaN     150.0
1 Laptops        180.0       NaN
  Phones         120.0       NaN
  Shirts           NaN     160.0

In [ ]:
# Unstack back to wide

long.unstack()

  Electronics               Clothing
      Laptops Phones Shirts  Laptops Phones Shirts
0       200.0  100.0    NaN      NaN    NaN  150.0
1       180.0  120.0    NaN      NaN    NaN  160.0